[
    {
        "id": "4471103b-d22f-4955-a162-81ad5b15ed29",
        "name": "Undead Unluck",
        "author": "Tozuka, Yoshifumi",
        "description": "As an unlucky girl prepares to face her death, an undead who desperately wants to die appears before her! Vicious, violent and buck naked! An unprecedented picaresque hero appears in Shonen Jump! (Source: MANGA Plus)",
        "cover_img": "https://img.mangakakalot.to/_r/300x400/100/bd/be/bdbe2e9db72e824163f0b60ca76962cd/bdbe2e9db72e824163f0b60ca76962cd.jpg",
        "slug": "undead-unluck",
        "Like": 1,
        "chapters": []
    },
    {
        "id": "4471103b-d22f-4955-a162-81ad5b15ed28",
        "name": "Purple Hyacinth",
        "author": "Updating",
        "description": "Her ability to detect lies has made her an outstanding officer of the law ΓÇô despite being haunted by her inability to save the ones she loved from a gruesome fate many years ago. Now, she uses her powerful gift to defend the defenseless at any cost ΓÇô even if it means teaming up with a deadly assassin to fight evil in a world gone mad.",
        "cover_img": "https://img.mangakakalot.to/_r/300x400/100/82/5d/825d48a1c6773aa313f3e61ad07b21cb/825d48a1c6773aa313f3e61ad07b21cb.jpg",
        "slug": "purple-hyacinth",
        "Like": 2,
        "chapters": []
    },
    {
        "id": "4458103b-d22f-4955-a162-81ad5b15ed28",
        "name": "Ayashimon",
        "author": "Updating",
        "description": "Maruo, a boy starved for battle, meets Urara, a girl trying to escape from underworld thugs... A supernatural yakuza story by Yuji Kaku, the creator of Hell's Paradise: Jigokuraku!",
        "cover_img": "https://img.mangakakalot.to/_r/300x400/100/a2/ad/a2ad0fbfb5c3ce048a8315e445ed3cdd/a2ad0fbfb5c3ce048a8315e445ed3cdd.jpg",
        "slug": "ayashimon",
        "Like": 0,
        "chapters": []
    },
    {
        "id": "4448103b-d22f-4955-a162-81ad5b15ed28",
        "name": "Orient",
        "author": "Ohtaka, Shinobu",
        "description": "Five years ago, Musashi made a promise with his friend Kojirou Kanemaki that once they grew up, they would become samurai, form a league, and go on demon-slaying quests. But since then, things have changed. With demons now being praised and worshipped by society, the samurai are shunned and disgraced. Afraid of revealing his dream of becoming a samurai, Musashi blends into the town's dogma by becoming a miner while secretly polishing his swordsmanship. Meanwhile, despite being a direct descendant of a samurai, Kojirou gives up on his promise to his old friend. However, after saving Musashi from a near-death experience, his perspective shifts. Although still conflicted, Kojirou embarks on a journey with Musashi in the hopes of figuring out his true feelings. Fighting against all odds, the duo dives headfirst into the unknown world of beast-slaying, not knowing what life has in store for them. Now astride iron horses, the 15-year-old heroes plan to restore the tarnished reputation of the samurai and purge the world of demons.",
        "cover_img": "https://img.mangakakalot.to/_r/300x400/100/eb/01/eb0165e5777b2051936831349bf69532/eb0165e5777b2051936831349bf69532.jpg",
        "slug": "orient",
        "Like": 0,
        "chapters": []
    },
    {
        "id": "4438103b-d22f-4955-a162-81ad5b15ed28",
        "name": "One Piece",
        "author": "Eiichiro Oda",
        "description": "Gol D. Roger, a man referred to as the \"Pirate King,\" is set to be executed by the World Government. But just before his demise, he confirms the existence of a great treasure, One Piece, located somewhere within the vast ocean known as the Grand Line. Announcing that One Piece can be claimed by anyone worthy enough to reach it, the Pirate King is executed and the Great Age of Pirates begins. Twenty-two years later, a young man by the name of Monkey D. Luffy is ready to embark on his own adventure, searching for One Piece and striving to become the new Pirate King. Armed with just a straw hat, a small boat, and an elastic body, he sets out on a fantastic journey to gather his own crew and a worthy ship that will take them across the Grand Line to claim the greatest status on the high seas.",
        "cover_img": "http://truyentranhtuan.com/wp-content/uploads/2013/01/one-piece-anh-bia-200x304.jpg",
        "slug": "one-piece",
        "Like": 1,
        "chapters": [
            {
                "id": "f59b1ebf-58e0-498a-9431-c67e62091282",
                "created_at": "2022-06-21T11:21:08.791960+07:00",
                "updated_at": "2022-06-21T11:21:08.792534+07:00",
                "name": "Chapter 1: Romance Dawn",
                "index": 1,
                "view": 2,
                "comic": "4438103b-d22f-4955-a162-81ad5b15ed28"
            },
            {
                "id": "f69b1ebf-58e0-498a-9431-c67e62091282",
                "created_at": "2022-06-21T11:21:08.793729+07:00",
                "updated_at": "2022-06-21T11:21:08.794263+07:00",
                "name": "Chapter 2: Luffy Straw Hat",
                "index": 2,
                "view": 1,
                "comic": "4438103b-d22f-4955-a162-81ad5b15ed28"
            },
            {
                "id": "f29b1ebf-58e0-498a-9431-c67e62091282",
                "created_at": "2022-06-21T11:21:08.795428+07:00",
                "updated_at": "2022-06-21T11:21:08.795961+07:00",
                "name": "Chapter 3: Zoro",
                "index": 3,
                "view": 2,
                "comic": "4438103b-d22f-4955-a162-81ad5b15ed28"
            }
        ]
    },
    {
        "id": "4428103b-d22f-4955-a162-81ad5b15ed28",
        "name": "The Elusive Samurai",
        "author": "Matsui, Yuusei",
        "description": "Set in feudal Japan in between the Kamakura and Muromachi periods, our hero Tokiyuki Hojo is a boy on the run that history all but forgot! When the Kamakura shogunate is overthrown by Takauji Ashikaga, Tokiyuki's family and standing are viciously taken away from him, and he must flee to the far reaches of the land to survive and seek out his revenge!",
        "cover_img": "https://img.mangakakalot.to/_r/300x400/100/ab/68/ab6838a0d62202a942a2ae4010beded4/ab6838a0d62202a942a2ae4010beded4.jpg",
        "slug": "the-elusive-samurai",
        "Like": 0,
        "chapters": []
    },
    {
        "id": "4418103b-d22f-4955-a162-81ad5b15ed28",
        "name": "Naruto",
        "author": "Kishimoto Masashi",
        "description": "Whenever Naruto Uzumaki proclaims that he will someday become the HokageΓêÖa title bestowed upon the best ninja in the Village Hidden in the LeavesΓêÖno one takes him seriously. Since birth, Naruto has been shunned and ridiculed by his fellow villagers. But their contempt isn't because Naruto is loud-mouthed, mischievous, or because of his ineptitude in the ninja arts, but because there is a demon inside him. Prior to Naruto's birth, the powerful and deadly Nine-Tailed Fox attacked the village. In order to stop the rampage, the Fourth Hokage sacrificed his life to seal the demon inside the body of the newborn Naruto. And so when he is assigned to Team 7ΓêÖalong with his new teammates Sasuke Uchiha and Sakura Haruno, under the mentorship of veteran ninja Kakashi HatakeΓêÖNaruto is forced to work together with other people for the first time in his life. Through undergoing vigorous training and taking on challenging missions, Naruto must learn what it means to work in a team and carve his own route toward becoming a full-fledged ninja recognized by his village.",
        "cover_img": "http://truyentranhtuan.com/wp-content/uploads/2013/01/naruto-anh-bia-200x304.jpg",
        "slug": "naruto",
        "Like": 1,
        "chapters": [
            {
                "id": "f49b1ebf-58e0-498a-9431-c67e62091282",
                "created_at": "2022-06-21T11:21:08.797137+07:00",
                "updated_at": "2022-06-21T11:21:08.797626+07:00",
                "name": "Chapter 1",
                "index": 1,
                "view": 7,
                "comic": "4418103b-d22f-4955-a162-81ad5b15ed28"
            },
            {
                "id": "f19b1ebf-58e0-498a-9431-c67e62091282",
                "created_at": "2022-06-21T11:21:08.798667+07:00",
                "updated_at": "2022-06-21T11:21:08.799085+07:00",
                "name": "Chapter 2",
                "index": 2,
                "view": 125,
                "comic": "4418103b-d22f-4955-a162-81ad5b15ed28"
            }
        ]
    },
    {
        "id": "4778103b-d22f-4955-a162-81ad5b15ed28",
        "name": "Boruto Naruto Next Generation",
        "author": "Ikemoto, Mikio, Kodachi, Ukyo",
        "description": "Naruto Uzumaki has finally achieved his dream of becoming Hokage, the leader of the Hidden Leaf Village that he spent his teenage years fighting to protect. Naruto and his peers now live in a world of peace, working hard to uphold an international truce built on good will and diplomacy. However, this stasis comes at a personal cost for the aging hero. Naruto and the shinobi he grew up alongside find that working to upkeep the neutral world takes them away from their families, and even the legendary warriors of Naruto's generation must contend with being mediocre parents to their bitter children, including his own son Boruto. Boruto Uzumaki faces a world completely unlike that of his father, finding unique trouble in the distance between the two. Contending with a society that heaps an unbearable load of pressure on his shoulders over his status as the Hokage's son, Boruto carves his own path through the world, fighting to make a name for himself as evil forces threaten to shatter the peace his father helped create.",
        "cover_img": "https://img.mangakakalot.to/_r/300x400/100/fd/7a/fd7a96ed4892d77d40953f64f9193209/fd7a96ed4892d77d40953f64f9193209.jpg",
        "slug": "boruto-naruto-next-generation",
        "Like": 0,
        "chapters": []
    },
    {
        "id": "4678103b-d22f-4955-a162-81ad5b15ed28",
        "name": "Onepunch-Man",
        "author": "Murata Yuusuke",
        "description": "After rigorously training for three years, the ordinary Saitama has gained immense strength which allows him to take out anyone and anything with just one punch. He decides to put his new skill to good use by becoming a hero. However, he quickly becomes bored with easily defeating monsters, and wants someone to give him a challenge to bring back the spark of being a hero. Upon bearing witness to Saitama's amazing power, Genos, a cyborg, is determined to become Saitama's apprentice. During this time, Saitama realizes he is neither getting the recognition that he deserves nor known by the people due to him not being a part of the Hero Association. Wanting to boost his reputation, Saitama decides to have Genos register with him, in exchange for taking him in as a pupil. Together, the two begin working their way up toward becoming true heroes, hoping to find strong enemies and earn respect in the process.",
        "cover_img": "http://truyentranhtuan.com/wp-content/uploads/2013/10/onepunch-man-200x304.jpg",
        "slug": "onepunch-man",
        "Like": 0,
        "chapters": [
            {
                "id": "f39b1ebf-58e0-498a-9431-c67e62091282",
                "created_at": "2022-06-21T11:21:08.789825+07:00",
                "updated_at": "2022-06-21T11:21:08.790594+07:00",
                "name": "Chapter 1",
                "index": 1,
                "view": 5,
                "comic": "4678103b-d22f-4955-a162-81ad5b15ed28"
            }
        ]
    },
    {
        "id": "4578103b-d22f-4955-a162-81ad5b15ed28",
        "name": "Teasing Master Takagi-san",
        "author": "Yamamoto, Souichirou",
        "description": "With a smirk, the mischievous middle school boy Nishikata glances over at Takagi, the girl seated next to him in class. He has just devised a master plan to finally get back at her for all the merciless teasing inflicted upon him. As he is about to set his plan into motion, Takagi intervenes with a single comment that halts Nishikata right in his tracks. She had turned the tables on him yet again. \"If you blush, you lose.\" That has been the unwritten rule set between the two ever since they encountered one another in middle school. Day after day, loss after loss, Nishikata strives to see Takagi red with embarrassment, but his futile attempts are only met by further ridicule. Beyond this vicious cycle of trying to outwit one another, will their relationship ever evolve?",
        "cover_img": "https://img.mangakakalot.to/_r/300x400/100/31/0f/310f1d60fc03b2d265793afec7c0f7ce/310f1d60fc03b2d265793afec7c0f7ce.jpg",
        "slug": "teasing-master-takagi-san",
        "Like": 0,
        "chapters": []
    }
]
